from data import db_session
from data.controllers import Controller

db_session.global_init("db/products.db")
db_sess = db_session.create_session()

# put your code here:

product = Controller()
product.description = "Контроллер - многофункциональное устройство на основе 32bit микроконтроллера. На контроллере выведено 27 портов для подключения внешних устройств: 10 цифровых портов, 10 аналоговых портов, 1 USART, 1 I2C, 1 SPI, 4 порта для управления моторами постоянного тока, питание от 6 элементов питания типа AAA напряжением 1.2В. Контроллер поддерживает напряжение от 5В до 12В. Прошивается через порт USB Type C. На лицевой части контроллера есть программируемый джойстик, состоящий из 5 кнопок. Контроллер Lego- и Arduino- совместим."
product.technical_description = """– Размер (д*ш*в): 87х70х28мм
– Питание контроллера: 5-12В
– Выведено портов: 10 цифровых, 10 аналоговых, UART, SPI, I2C.
– Переключатели напряжения на шинах питания с 3.3.В на 5В
– Индикатор питания на лицевой панели
– Кнопка питания ВКЛ\ВЫКЛ на лицевой панели
– Джойстик, состоящий из 5 кнопок на лицевой панели
– Корпус, совместимый с Lego-деталями
– Порт для прошивки контроллера через порт USB Type-C
– 3 индикатора прошивка контроллера на лицевой части"""
product.technical_description_img = None
product.interface_name = "Интерфейсы"
product.interface_img = None
product.extra_info = """Если у вас перестал определятся контроллер и компьютер его не видит, то:
- Подключите контроллер к ПК;
- Скачайте файл https://disk.yandex.ru/d/OBsyPASRjJ5bHQ
- Распакуйте архив;
- Запустите файл от имени администратора redx_repair.exe;
- Нажмите RESET на контроллере, Готово."""
product.warning = """Внимание!
Питание контроллера в корпусе осуществляется от 6 элементов питания типа ААА
(Общее напряжение должно составлять от 5 до 12В)"""
product.warning_img = None
db_sess.add(product)
db_sess.commit()
